a = 3       # Python розуміє, що це число (int)
a = "Hello" # Тепер змінна стала рядком (str)
print(a)

b = a
print(b)

a = ("Текст")
print(a)

a = 10
a = a + 5  # Створюється новий об'єкт
print(a)

s = "Hello"
s = s + " World"  # створюється новий рядок
print(s)

lst = [1, 2, 3]
lst[0] = 42  # Значення змінюється в тому ж об'єкті
print(lst)

d = {"a": 1}
d["b"] = 2  # Додається нова пара ключ-значення
print(d)

list1 = [1, 2, 3]
list2 = list1
print(list1,list2)

list1[0] = 99 # Якщо змінити список через list1
print(list2) # list2 теж змінюється, бо це той самий об'єкт

list1 = [1, 2, 3] # Щоб уникнути , потрібно створити копію.
list2 = list1[:]  # Копія списку
list1[0] = 99
print(list2)  # [1, 2, 3]

list1 = [1, 2, 3]
list2 = [1, 2, 3]
print(list1 == list2)  # True (значення однакові)
print(list1 is list2)
print(list1 is list1)

a = 42
b = 42
print(a is b)
txt = """Python дозволяє змінним бути посиланнями на об'єкти будь-якого типу.
Типи об'єктів визначаються автоматично.
Є незмінювані (числа, строки) та змінювані (списки, словники) об'єкти."""
print(txt)